# ParameterFailures Properties

---
The BuiltInFailuresParameterFailures type exposes the following members.
| Name| Description
---|---|---
| InconsistentSharedParameterDefinitions|  The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.
| UnrecognizedSharedParameterDataType|  The shared parameter '...' with name '...' cannot be added because its data type is not recognized.
Top
#### Reference
BuiltInFailuresParameterFailures Class
Autodesk.Revit.DB Namespace